# Задание №2
print("Введите по порядку этапы развития человека.")
stage1=input("Первый этап ")
stage2=input("Второй этап ")
stage3=input("Третий этап ")
stage4=input("Четвертый этап ")
stage5=input("Пятый этап ")
stage6=input("Шестой этап ")
print(stage1,stage2,stage3,stage4,stage5,stage6,sep="=>")